Repository: igdj/jewish-history-online
Catalog: app/Resources/translations/menu.*.xlf
Languages: de

source: Authors
de: Autor_innen

source: Edition and Edition Guidelines
de: Edition und Editionsrichtlinien

source: Editorial Model
de: Redaktionsmodell

source: Editors
de: Herausgeber_innen

source: Goals
de: Ziele

source: How to Use this Edition
de: Nutzungshinweise

source: Key Documents
de: Schl√ºsseldokumente

source: Staff
de: Mitarbeiter_innen

source: Target Audience
de: Zielgruppe

source: Technical Implementation
de: Technische Umsetzung
